<p>
    Команда <strong>CBAY.COM.CY</strong> рада приветствовать Вас на сайте бесплатных объявлений, где Вы можете легко покупать и быстро продавать.
</p>
<p>
    Завершив регистрацию вы получили доступ к личному кабинету, где сможете просматривать и редактировать объявления, пополнять кошелек,  просматривать историю сообщений, заказывать услуги и др.
</p>
<p>
    В качестве бонуса для новых пользователей, Вы получаете <strong>5 евро</strong> на счет кошелька в личном кабинете.
</p>
<p>
    С наилучшими пожеланиями, <a href="http://www.cbay.com.cy">http://www.cbay.com.cy</a>
</p>