<h1>Здравствуйте, <?= $user; ?></h1>
<p>
    Команда <strong>CBAY.COM.CY</strong> благодарит Вас за регистрацию на нашем сайте.
</p>
<p>
    Ваши регистрационные данные для входа на сайт:
</p>
<strong>Логин (e-mail):</strong> <?= $email; ?>
<br>
<strong>Пароль:</strong> <?= $password; ?>
<p>
    После регистрации на сайте, Вы получили доступ к личному кабинету, где сможете просматривать и редактировать объявления, пополнять кошелек,  просматривать историю сообщений, заказывать услуги и др.
</p>
<p>
    С наилучшими пожеланиями, <a href="http://www.cbay.com.cy">http://www.cbay.com.cy</a>
</p>