<?php

defined('SYSPATH') or die('No direct script access.');

class Text extends Kohana_Text {

	public static function switch_text($string) {
		/* Символы которые нужно исключить из строки */
		$delChar = array('!' => '', '&' => '', '?' => '', '/' => '');
		
		/* Исключения */
		$expectWord = array('.ьу' => '/me');
		
		/* Символы для замены на русские */
		$arrReplace = array('q' => 'й', 'w' => 'ц', 'e' => 'у', 'r' => 'к', 't' => 'е', 'y' => 'н', 'u' => 'г', 'i' => 'ш', 'o' => 'щ', 'p' => 'з', '[' => 'х', ']' => 'ъ', 'a' => 'ф', 's' => 'ы', 'd' => 'в', 'f' => 'а', 'g' => 'п', 'h' => 'р', 'j' => 'о', 'k' => 'л', 'l' => 'д', ';' => 'ж', "'" => 'э', 'z' => 'я', 'x' => 'ч', 'c' => 'с', 'v' => 'м', 'b' => 'и', 'n' => 'т', 'm' => 'ь', ',' => 'б', '.' => 'ю', '/' => '.', '`' => 'ё', 'Q' => 'Й', 'W' => 'Ц', 'E' => 'У', 'R' => 'К', 'T' => 'Е', 'Y' => 'Н', 'U' => 'Г', 'I' => 'Ш', 'O' => 'Щ', 'P' => 'З', '{' => 'Х', '}' => 'Ъ', 'A' => 'Ф', 'S' => 'Ы', 'D' => 'В', 'F' => 'А', 'G' => 'П', 'H' => 'Р', 'J' => 'О', 'K' => 'Л', 'L' => 'Д', ':' => 'Ж', '"' => 'Э', '|' => '/', 'Z' => 'Я', 'X' => 'Ч', 'C' => 'С', 'V' => 'М', 'B' => 'И', 'N' => 'Т', 'M' => 'Ь', '<' => 'Б', '>' => 'Ю', '?' => ',', '~' => 'Ё', '@' => '"', '#' => '№', '$' => ';', '^' => ':', '&' => '?');
		
		/* Меняем ключ со значением в массиве $arrReplace */
		$arrReplace2 = array_flip($arrReplace);
		
		/* Удаляем некоторые символы */
		unset($arrReplace2['.']);
		unset($arrReplace2[',']);
		unset($arrReplace2[';']);
		unset($arrReplace2['"']);
		unset($arrReplace2['?']);
		unset($arrReplace2['/']);
		
		/* И соединяем массивы в один */
		$arrReplace = array_merge($arrReplace, $arrReplace2);
		
		/* Переводим в нижний регистр, удаляем пробелы с начала и конца, разбиваем предложение на слова */
		$string2 = strtr(trim(strtolower($string)), $delChar);
		$arrString = explode(" ", $string2);


		return strtr(strtr($string, $arrReplace), $expectWord);
	}

	public static function translit($str) {
		$tr = array(
			"А" => "A", "Б" => "B", "В" => "V", "Г" => "G",
			"Д" => "D", "Е" => "E", "Ж" => "J", "З" => "Z", "И" => "I",
			"Й" => "Y", "К" => "K", "Л" => "L", "М" => "M", "Н" => "N",
			"О" => "O", "П" => "P", "Р" => "R", "С" => "S", "Т" => "T",
			"У" => "U", "Ф" => "F", "Х" => "H", "Ц" => "TS", "Ч" => "CH",
			"Ш" => "SH", "Щ" => "SCH", "Ъ" => "", "Ы" => "YI", "Ь" => "",
			"Э" => "E", "Ю" => "YU", "Я" => "YA", "а" => "a", "б" => "b",
			"в" => "v", "г" => "g", "д" => "d", "е" => "e", "ж" => "j",
			"з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l",
			"м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r",
			"с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h",
			"ц" => "ts", "ч" => "ch", "ш" => "sh", "щ" => "sch", "ъ" => "y",
			"ы" => "yi", "ь" => "", "э" => "e", "ю" => "yu", "я" => "ya"
		);

		return strtr($str, $tr);
	}

	public static function decline($number, array $words) {
		$cases = array(2, 0, 1, 1, 1, 2);
		return $number . ' ' . $words[($number % 100 > 4 && $number % 100 < 20) ? 2 : $cases[min($number % 10, 5)]];
	}

}

