<div class="hero-unit">
	<h1>Заголовок для русской статьи</h1>
	<hr />

	<p>Проект стартовал в август 2013 года.</p>


	<hr />

	<h3>Зачем люди идут на сайт</h3>
	<p>На сайт люди обычно заходят с целью продажи или покупки любых товаров – от одежды и мебели до автомобилей и недвижимости.</p>
	<p>Более 40 % товаров удается продать на сайте всего за одну неделю!</p>

	<hr />

	<h3>Для кого мы работаем</h3>
	<p>Объявления на сайте размещают в основном частные лица, однако сайт также представляет интерес для компаний и индивидуальных предпринимателей, поэтому на сайте можно покупать не только бывшие в употреблении, но и совершенно новые товары.</p>

	<hr />
	
	<h3>География</h3>
	<p>В настоящий момент сайт доступен на всей территории Кипра.</p>
</div>
