<div class="hero-unit">
	<h1>Заголовок для английской версии</h1>
	<hr />

	<p>Проект стартовал в ноябре 2012 года и всего за 4 года стал абсолютным лидером в своем сегменте, быстро обогнав всех конкурентов.</p>
	<p>На сегодняшний день сайт признан лучшим брендом в категории «Товары и услуги»</p>
	<p>Согласно данным специальных исследований компании MASMI, 90% населения Москвы и Санкт-Петербурга, а также 66% населения 13 крупнейших регионов России знают об AVITO.ru.</p>

	<hr />

	<h3>Зачем люди идут на сайт</h3>
	<p>На сайт люди обычно заходят с целью продажи или покупки любых товаров – от одежды и мебели до автомобилей и недвижимости.</p>
	<p>Более 40 % товаров удается продать на сайте всего за одну неделю!</p>

	<hr />

	<h3>Для кого мы работаем</h3>
	<p>Объявления на сайте размещают в основном частные лица, однако сайт также представляет интерес для компаний и индивидуальных предпринимателей, поэтому на сайте можно покупать не только бывшие в употреблении, но и совершенно новые товары.</p>

	<hr />
	
	<h3>География</h3>
	<p>В настоящий момент сайт доступен на всей территории Кипра.</p>
</div>
